app/views/topics/index.html.haml

SELECT "links".* FROM "links" WHERE "links"."topic_id" = 1
SELECT COUNT(*) FROM "links" WHERE "links"."topic_id" = 1
---
              %h5
                - if topic.links.empty?