hinfo/app/views/topics/index.html.haml

              %h5
                - unless topic.links.empty?
---
SELECT "links".* FROM "links" WHERE "links"."topic_id" = 1
SELECT COUNT(*) FROM "links" WHERE "links"."topic_id" = 1