app/controllers/links_controller.rb

SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "links" ("created_at", "name", "path", "topic_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 13 Feb 2012 13:16:40 UTC +00:00], ["name", nil], ["path", "http://www.podmedics.com"], ["topic_id", 1], ["updated_at", Mon, 13 Feb 2012 13:16:40 UTC +00:00]]
---
  def create
    @topic = Topic.find(params[:topic_id])
    @link = @topic.links.create(params[:link])