app/controllers/topics_controller.rb

SELECT "links".* FROM "links" WHERE "links"."topic_id" = 1
SELECT "topics".* FROM "topics"
---
  def index
  	@topics = Topic.includes(:links)